import React, {useState} from 'react'
import {View , Text, FlatList,Share, Image, TouchableOpacity} from 'react-native'
import style from './style'
import Tts from 'react-native-tts';
import Clipboard from '@react-native-clipboard/clipboard';
import Snackbar from 'react-native-snackbar';
import {  } from 'react-native-gesture-handler';


export default function Bangla() {
    const[data]=useState([
        {id:"1",ban:'আর রাহমান', mean:'অর্থঃ পরম দয়ালু, পরম করুণাময়, কল্যাণময়'},
            {id:"2",ban:'আর রহিম', mean:'অর্থঃ অতিশয়-মেহেরবান, অতি দয়ালু'},
            {id:"3",ban:'আল-মালিক',mean:'অর্থঃ সর্বকর্তৃত্বময়, অধিপতি, মালিক'},
            {id:"4",ban:'আল-কুদ্দুস',mean:'অর্থঃ নিষ্কলুষ, অতি পবিত্র'},
            {id:"5",ban:'আস-সালাম',mean:'অর্থঃ নিরাপত্তা-দানকারী, শান্তি-দানকারী, দোষমুক্ত'},
            {id:"6",ban:'আল-মুমিন',mean:'অর্থঃ নিরাপত্তা ও ঈমান দানকারী, সত্য ঘোষণাকারী'},
            {id:"7",ban:'আল-মুহাইমিন',mean:'অর্থঃ পরিপূর্ন রক্ষণাবেক্ষণকারী, রক্ষক, অভিভাবক'},
            {id:"8",ban:'আল-আজীজ',mean:'অর্থঃ পরাক্রমশালী, অপরাজেয়, সর্বাধিক সম্মানিত'},
            {id:"9",ban:'আল-জাব্বার',mean:'অর্থঃ দুর্নিবার, মহাপ্রতাপশালী, অতীব মহিমান্বিত'},
            {id:"10",ban:'আল-মুতাকাব্বিইর',mean:'নিরঙ্কুশ শ্রেষ্ঠত্বের অধিকারী, সর্বশ্রেষ্ঠ, গৌরবান্বিত'},
            {id:"11",ban:'আল-খালিক্ব',mean:'অর্থঃ সৃষ্টিকর্তা, সৃষ্টিকারী'},
            {id:"12",ban:'আল-বারী',mean:'অর্থঃ সঠিকভাবে সৃষ্টিকারী'},
            {id:"13",ban:'আল-মুছউইর',mean:'অর্থঃ আকৃতি-দানকারী'},
            {id:"14",ban:'আল-গফ্ফার',mean:'অর্থঃ পরম ক্ষমাশীল, অতি ক্ষমাশীল'},
            {id:"15",ban:'আল-ক্বাহার',mean:'অর্থঃ কঠোর, মহাপ্রতাবশালী, দমনকারী'},
            {id:"16",ban:'আল-ওয়াহ্হাব',mean:'অর্থঃ সবকিছু দানকারী, দানশীল, স্থাপনাকারী'},
            {id:"17",ban:'আল ফাত্তাহ',mean:'অর্থঃ বিজয়দানকারী, শ্রেষ্ঠ ফয়সালাকারী, প্রারম্ভকারী'},
            {id:"18",ban:'আল-আলীম',mean:'অর্থঃ সর্বজ্ঞ, মহাজ্ঞানী'},
            {id:"19",ban:'আল-ক্ববিদ্ব',mean:'অর্থঃ নিয়ন্ত্রণকারী, সরল পথ প্রদর্শনকারী'},
            {id:"20",ban:'আর-রজ্জাক্ব',mean:'অর্থঃ রিযিকদাতা'},
            {id:"21",ban:'আল-বাসিত',mean:'অর্থঃ প্রশস্তকারী'},
            {id:"22",ban:'আর-রফীই',mean:'অর্থঃ উন্নতকারী, উঁচুকারী'},
            {id:"23",ban:'আল-মুইজ্ব',mean:'অর্থঃ সম্মান-দানকারী'},
            {id:"24",ban:'আল-মুদ্বিল্লু, আল-মুযিল্ল',mean:'অর্থঃ (অবিশ্বাসীদের) বেইজ্জতকারী, সম্মান হরণকারী'},
            {id:"25",ban:'আস্-সামিই',mean:'অর্থঃ সর্বশ্রোতা'},
            {id:"26",ban:'আল-খফিদ্বু',mean:'অর্থঃ অবনতকারী'},
            {id:"27",ban:'আল-বাছীর',mean:'অর্থঃ সর্ববিষয়-দর্শনকারী, সর্বদ্রষ্টা'},
            {id:"28",ban:'আল-হাকাম',mean:'অর্থঃ অটল বিচারক, মহা বিচারপতি, হুকুমদাতা'},
            {id:"29",ban:'আল-আদল',mean:'অর্থঃ পরিপূর্ণ-ন্যায়বিচারক, নিখুঁত, ন্যায় বিচারক'},
            {id:"30",ban:'আল-লাতীফ',mean:'অর্থঃ সকল-গোপন-বিষয়ে-অবগত, সূক্ষ্মদর্শী, অমায়িক'},
            {id:"31",ban:'আল-খবীর',mean:'অর্থঃ সকল ব্যাপারে জ্ঞাত, সর্বজ্ঞ'},
            {id:"32",ban:'আল-হালীম',mean:'অর্থঃ অত্যন্ত ধৈর্যশীল, মহা সহনশীল, প্রশ্রয়দাতা'},
            {id:"33",ban:"আল-আ'জীম",mean:'অর্থঃ সর্বোচ্চ-মর্যাদাশীল, মহা মর্যাদাপূর্ণ, অতি বিরাট'},
            {id:"34",ban:'আল-গফুর',mean:'অর্থঃ পরম ক্ষমাশীল, মার্জনাকারী, অতীব ক্ষমাশীল'},
            {id:"35",ban:'আশ্-শাকুর',mean:'অর্থঃ গুনগ্রাহী, সুবিবেচক'},
            {id:"37",ban:"আল-আ'লিইউ",mean:'অর্থঃ উচ্চ-মর্যাদাশীল'},
            {id:"38",ban:'আল-কাবিইর',mean:'অর্থঃ সুমহান, অতি বিরাট'},
            {id:"39",ban:"আল-হা'ফীজ",mean:'অর্থঃ সংরক্ষণকারী'},
            {id:"40",ban:'আল-মুক্বীত',mean:'অর্থঃ সকলের জীবনোপকরণ-দানকারী, সংরক্ষণকারী,'},
            {id:"41",ban:'আল-হাসীব',mean:'অর্থঃ হিসাব-গ্রহণকারী, মহা মীমাংসাকারী'},
            {id:"42",ban:'আল-জালীল',mean:'অর্থঃ পরম মর্যাদার অধিকারী, গৌরবান্বিত'},
            {id:"43",ban:'আল-কারীম',mean:'অর্থঃ সুমহান দাতা, মহা সম্মানিত, মহা দয়ালু'},
            {id:"44",ban:'আর-রক্বীব',mean:'অর্থঃ তত্ত্বাবধায়ক'},
            {id:"45",ban:'আল-মুজীব',mean:'অর্থঃ জবাব-দানকারী, সাড়া দানকারী, দো‘আ কবুলকারী'},
            {id:"46",ban:'আল-ওয়াসি',mean:'অর্থঃ সর্ব-ব্যাপী, অসীম, ব্যাপক'},
            {id:"47",ban:'আল-হাকীম',mean:'অর্থঃ পরম-প্রজ্ঞাময়, সুবিজ্ঞ, সুদক্ষ'},
            {id:"48",ban:'আল-ওয়াদুদ',mean:'অর্থঃ (বান্দাদের প্রতি) সদয়, প্রেমময়, পরম স্নেহশীল'},
            {id:"49",ban:'আল-মাজীদ',mean:'অর্থঃ সকল-মর্যাদার-অধিকারী, মহিমান্বিত, সম্মানিত'},
            {id:"50",ban:"আল-বাই'ছ'",mean:'অর্থঃ পুনুরুজ্জীবিতকারী'},
            {id:"51",ban:'আশ্-শাহীদ',mean:'অর্থঃ সর্বজ্ঞ-স্বাক্ষী, প্রত্যক্ষদর্শী'},
            {id:"52",ban:"আল-হা'ক্ব",mean:'অর্থঃ পরম সত্য'},
            {id:"53",ban:'আল-ওয়াকিল',mean:'অর্থঃ পরম নির্ভরযোগ্য কর্ম-সম্পাদনকারী, তত্ত্বাবধায়ক,'},
            {id:"54",ban:'আল-ক্বউইউ',mean:'অর্থঃ পরম-শক্তির-অধিকারী'},
            {id:"55",ban:'আল-মাতীন',mean:'অর্থঃ সুদৃঢ়, সুস্থির'},
            {id:"56",ban:'আল-ওয়ালিইউ',mean:'অর্থঃ অভিভাবক ও সাহায্যকারী'},
            {id:"57",ban:"আল-হা'মীদ",mean:'অর্থঃ সকল প্রশংসার অধিকারী'},
            {id:"58",ban:'আল-মুহছী',mean:'অর্থঃ সকল সৃষ্টির ব্যপারে অবগত'},
            {id:"59",ban:'আল-মুব্দি',mean:'অর্থঃ প্রথমবার-সৃষ্টিকর্তা, অগ্রণী, প্রথম প্রবর্তক'},
            {id:"60",ban:"আল-মুঈ'দ",mean:'অর্থঃ পুনরায়-সৃষ্টিকর্তা'},
            {id:"61",ban:"আল-মুহ'য়ী",mean:'অর্থঃ জীবন-দানকারী'},
            {id:"62",ban:'আল-মুমীত',mean:'অর্থঃ মৃত্যু-দানকারী'},
            {id:"63",ban:'আল-হাইয়্যু',mean:'অর্থঃ চিরঞ্জীব, যার কোন শেষ নেই'},
            {id:"64",ban:'আল-ক্বাইয়্যুম',mean:'অর্থঃ সমস্তকিছুর ধারক ও সংরক্ষণকারী'},
            {id:"65",ban:'আল-ওয়াজিদ',mean:'অর্থঃ অফুরন্ত ভান্ডারের অধিকারী'},
            {id:"66",ban:'আল-মুহীত',mean:'অর্থঃ পরিবেষ্টনকারী, সর্ব বেষ্টনকারী'},
            {id:"67",ban:"আল-ওয়াহি'দ",mean:'অর্থঃ এক ও অদ্বিতীয়'},
            {id:"68",ban:'আছ্-ছমাদ',mean:'অর্থঃ অমুখাপেক্ষী,অবিনশ্বর, চিরন্তন'},
            {id:"69",ban:'আল-ক্বদির',mean:'অর্থঃ সর্বশক্তিমান, মহা ক্ষমতাধর'},
            {id:"70",ban:'আল-মুক্ব্তাদির',mean:'অর্থঃ নিরঙ্কুশ-সিদ্বান্তের-অধিকারী'},
            {id:"71",ban:'আল-মুক্বদ্দিম',mean:'অর্থঃ অগ্রসারক, সর্বাগ্রে সহায়তা প্রদানকারী'},
            {id:"72",ban:'আল-মুয়াক্খির',mean:'অর্থঃ অবকাশ দানকারী, বিলম্বকারী'},
            {id:"73",ban:'আল-আউয়াল',mean:'অর্থঃ অনাদি, প্রথম'},
            {id:"74",ban:'আল-আখির',mean:'অর্থঃ অনন্ত, সর্বশেষ'},
            {id:"75",ban:"আজ-জ'হির",mean:'অর্থঃ সম্পূর্নরূপে-প্রকাশিত, প্রকাশ্য'},
            {id:"76",ban:'আল-বাত্বিন',mean:'অর্থঃ দৃষ্টি হতে অদৃশ্য, গোপন'},
            {id:"77",ban:'আল-ওয়ালি',mean:'অর্থঃ সমস্ত কিছুর অভিভাবক'},
            {id:"78",ban:"আল-মুতাআ'লি",mean:'অর্থঃ সৃষ্টির গুনাবলীর উর্দ্ধে'},
            {id:"79",ban:'আল-বার্',mean:'অর্থঃ পরম-উপকারী, অণুগ্রহশীল, কল্যাণকারী'},
            {id:"80",ban:'আত্-তাওয়াব',mean:'অর্থঃ তাওবার তাওফিক দানকারী এবং কবুলকারী,'},
            {id:"81",ban:'আল-মুনতাক্বিম',mean:'অর্থঃ প্রতিশোধ-গ্রহণকারী'},
            {id:"82",ban:"আল-আ'ফঊ",mean:'অর্থঃ পরম-উদার, গুনাহ ক্ষমাকারী'},
            {id:"83",ban:'আর-রউফ',mean:'অর্থঃ পরম-স্নেহশীল, সদয়,'},
            {id:"84",ban:'যুল-জালালি-ওয়াল-ইকরাম',mean:'অর্থঃ মহিমান্বিত ও দয়াবান সত্তা, মহা মর্যাদাবান,'},
            {id:"85",ban:'আল-মুক্ব্সিত',mean:'অর্থঃ হকদারের হক-আদায়কারী'},
            {id:"86",ban:'আল-জামিই',mean:'অর্থঃ একত্রকারী, সমবেতকারী'},
            {id:"87",ban:'আল-গণিই',mean:'অর্থঃ অমুখাপেক্ষী ধনী'},
            {id:"88",ban:'আল-মুগণিই',mean:'অর্থঃ পরম-অভাবমোচনকারী, সমৃদ্ধকারী,'},
            {id:"89",ban:'আল-মানিই',mean:'অর্থঃ অকল্যাণরোধক, প্রতিরোধকারী, রক্ষাকর্তা,'},
            {id:"90",ban:'আয্-যর',mean:'অর্থঃ ক্ষতিসাধনকারী, যন্ত্রনাদানকারী, উৎপীড়নকারী'},
            {id:"91",ban:'আন্-নাফিই',mean:'অর্থঃ কল্যাণকারী, অনুগ্রাহক, উপকারকারী, হিতকারী'},
            {id:"92",ban:'আন্-নূর',mean:'অর্থঃ পরম-আলো, আলোক'},
            {id:"93",ban:'আল-হাদী',mean:'অর্থঃ পথ-প্রদর্শক, হিদায়েতকারী'},
            {id:"94",ban:'মালিকুল-মুলক',mean:'অর্থঃ সমগ্র জগতের বাদশাহ্'},
            {id:"95",ban:'আল-বাদীই',mean:'অর্থঃ অতুলনীয়'},
            {id:"96",ban:'আল-বাক্বী',mean:'অর্থঃ চিরস্থায়ী, অবিনশ্বর'},
            {id:"97",ban:'আল-ওয়ারিস',mean:'অর্থঃ উত্তরাধিকারী'},
            {id:"98",ban:'আর-রাশীদ',mean:'অর্থঃ সঠিক পথ-প্রদর্শক, বিচক্ষণ, সচেতন'},
            {id:"99",ban:'আস-সবুর',mean:'অর্থঃ অত্যধিক ধৈর্যধারণকারী'},
    ])
    return (
        <View> 
            <FlatList 
            data={data} 
            renderItem={({item})=> 
            
            <TouchableOpacity onPress={() =>{
                Clipboard.setString(item.ban +" "+ item.mean)
                Snackbar.show({
                    text: 'Copied Succesfully',
                    duration: Snackbar.LENGTH_SHORT,
                    action: {
                      text: 'UNDO',
                      textColor: 'green',
                      onPress: () => { /* Do something. */ },
                    },
                  });
            }}>
                <View style={style.box}>
                <Text style={style.name}> {item.ban} </Text>
                <View style={{display:'flex', justifyContent:'space-between', flexDirection:'row', alignItems:'center'}}> 
                <Text style={{width:'65%'}}> {item.mean} </Text>
                <View style={{display:'flex', flexDirection:'row'}}> 
                    <TouchableOpacity onPress={() => {
                        Tts.stop();
                        Tts.speak(item.ban + item.mean, {
                            androidParams: {
                              KEY_PARAM_PAN: -1,
                              KEY_PARAM_VOLUME: 1,
                              KEY_PARAM_STREAM: 'STREAM_MUSIC',
                            },
                          });
                          Tts.setDefaultLanguage('bn-BD');
                          Tts.setDefaultRate(0.4);
                    }} style={{width:20, height:20}}><Image style={{width:25,height:25}} source={require('./photo/mic.png')}   /></TouchableOpacity>
                    <TouchableOpacity onPress={() => {
                        const result = Share.share({
                            message:item.ban +" "+ item.mean
                        })
                        if(result=== Share.sharedAction){

                        }
                        else if(result === Share.dismissedAction){

                        }else{

                        }

                    }} style={{width:20, height:20, marginHorizontal:20}}><Image style={{width:25,height:25}} source={require('./photo/send.png')}   /></TouchableOpacity>
                </View>
                </View>
                
             </View> 
            </TouchableOpacity>  
                
                }
/>
        </View>
    )
}

